---
kind: property
id: P:Autodesk.Revit.DB.Viewport.ViewportPositioning
source: html/f82b1639-99e0-6951-28d2-ece6c5b6bc25.htm
---
# Autodesk.Revit.DB.Viewport.ViewportPositioning Property

Specifies the method the viewport will be positioned on the sheet when swapped to another view. Default is set to ViewportPositioning::ViewportCenter.

## Syntax (C#)
```csharp
public ViewportPositioning ViewportPositioning { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration